{
  "about_title": "About me",
  "about": "I'm a Full Stack developer with a extreme agile process, lean approach and a lot of web and mobile development skills. With a background of more than eight years of experience in development and problem solving.<br><br>My most recent job was in a successful startup, where I was the lead developer of a small but very efficient IT team.<br><br>I love to get involved in the open source community, contributing whenever possible for projects like React Native, Hanami.<br><br>I infuse a startup-like energy with fast results and lean approach into large projects and bring the quality and discipline from my skills and experience into startups teams. With a goal to solve problems and achieve results rather than deliver lines of code.",
  "highlights_title": "Highlights",
  "highlights": [
    "Skills with multiple languages",
    "Passion for best practices",
    "Fearless refactoring practitioner",
    "Super comfortable developing for frontend or backend",
    "Over 5 years of experience with home office",
    "Write a clean and reusable code",
    "Always willing to teach and even more to learn",
    "Über Problem-solving skills"
  ],
  "contact_title": "Contact me",
  "skills_title": "Skills",
  "skills": {
    "backend": {
          "title": "Backend",
          "items": [
              {
                  "percent": 92,
                  "title": "Ruby"
              },
              {
                "percent": 80,
                "title": "Ruby on Rails"
              },
              {
                "percent": 60,
                "title": "Elixir"
              },
              {
                "percent": 67,
                "title": "Phoenix"
              }
          ]
      },
    "frontend": {
          "title": "Frontend",
          "items": [
              {
                "percent": 85,
                "title": "React"
              },
              {
                "percent": 80,
                "title": "ES6+"
              },
              {
                  "percent": 90,
                  "title": "Redux"
              }
          ]
      },
    "methodologies": {
          "title": "Abilities",
          "items": [
              {
                "percent": 94,
                "title": "Problem Solving"
              },
              {
                  "percent": 75,
                  "title": "DevOps"
              },
              {
                "percent": 80,
                "title": "Soft skills"
              }
          ]
      },
    "mobile": {
        "title": "Mobile",
        "items": [
            {
                "percent": 93,
                "title": "React Native"
            },
            {
                "percent": 75,
                "title": "Android"
            }
        ]
    }
  },
  "tools_title": "Knowledge & Tools",
  "tools": [
      "BDD & TDD",
      "SOLID",
      "DDD",
      "GraphQl",
      "Rest",
      "Ecto",
      "Jasmine",
      "Detox",
      "Expo",
      "Unix",
      "Jest",
      "Redux Observable",
      "Redux Saga",
      "Aws",
      "Heroku",
      "Git"
  ],
  "experiences_title": "Experience",
  "experiences": [
      {
          "company": "Pet Anjo 2015 - 2018",
          "description": "I worked as a lead developer of this successful peer to peer marketplace startup. Directly involved in the analysis, definition and development of the best solutions for our problems.<br>During my time there, we were able to increase our GMV in 480% and our monthly active customers in 580%.<br><br>Constantly improving the Ruby on Rails platform, from the search algorithms to a better checkout process. Designed and implemented a gamification system to inspire quality of the hosts in order to boost conversions. Created the RESTful API and the native app build with React Native, Redux and Redux Saga.<br><br> I also introduced the DevOps culture and practices for the entire team so we cold build, test, and release faster and more reliably solutions."
      },
      {
          "company": "MeuMobi  2012 - 2015",
          "description": "Here I worked with the development of mobile solutions for major clients such as Santander, Cielo and Lafarge a french industrial company and the CAHP Credit Union.<br><br>Also with a cloud-based web development platform that allows users create HTML5 websites and mobile sites.<br><br>Creation of advanced algorithms for data import services with multiple data sources, such as RSS feeds, xml and Json REST APIs. Where challenges had to be overcome at the database and application layers."
      },
      {
          "company": "Código Digital 2011 - 2012",
          "description": "Development of apps and creation of web presences for multiple business. With greater focus on UX and Design using tools like bootstrap, sass and css3."
      },
      {
          "company": "Noix 2010 - 2011",
          "description": "Creation of real-time integration between the catalog and sales of a Magento Enterprise and the java ERP of a large local computer store to allow the safe, effective and controlled transfer of high importance data, such as customer addresses, orders and credit cards. <br>Also allow manage the catalog and stock of the online store through the ERP"
      }
  ],
  "education_title": "Education",
  "formations": [
    "Zend certified engineer",
    "Android Development, Full Stack Web Development and Algorimts at Udacity",
    "Undergraduate degree in progress"
  ],
  "languages_title": "Languages",
  "languages": [
      "Professional Spanish",
      "Fluent English"
  ]
}
